/*
§¯§Ñ§á§Ú§ã§Ñ§ä§î §á§â§à§Ô§â§Ñ§Þ§Þ§å, §Ü§à§ä§à§â§Ñ§ñ §ã§é§Ú§ä§í§Ó§Ñ§Ö§ä §ã §Ü§Ý§Ñ§Ó§Ú§Ñ§ä§å§â§í §ä§â§Ú  §è§Ö§Ý§í§ç §é§Ú§ã§Ý§Ñ §Ú §Ó§í§Ó§à§Õ§Ú§ä §ã§å§Þ§Þ§å (a+b+c) , §á§â§à§Ú§Ù§Ó§Ö§Õ§Ö§ß§Ú§Ö (a*b*c) §Ú §ã§â§Ö§Õ§ß§Ö§Ö §Ñ§â§Ú§æ§Þ§Ö§ä§Ú§é§Ö§ã§Ü§à§Ö ((a+b+c)/3) §ï§ä§Ú§ç §é§Ú§ã§Ö§Ý. §¬§Ñ§Ø§Õ§à§Ö §Ó§í§â§Ñ§Ø§Ö§ß§Ú§Ö §Õ§à§Ý§Ø§ß§à §Ò§í§ä§î §Ó§í§Ó§Ö§Õ§Ö§ß§à §ã §ß§à§Ó§à§Û §ã§ä§â§à§Ü§Ú. §±§â§Ú §Ó§í§Ó§à§Õ§Ö §â§Ö§Ù§å§Ý§î§ä§Ñ§ä§Ñ §Ü§Ñ§Ø§Õ§à§Û §à§á§Ö§â§Ñ§è§Ú§Ú §å§Ü§Ñ§Ù§Ñ§ä§î §Ó§ã§Ö §ã§Ý§Ñ§Ô§Ñ§Ö§Þ§í§Ö/§Þ§ß§à§Ø§Ú§ä§Ö§Ý§Ú (§ã§Þ§à§ä§â§Ú§ä§Ö §á§â§Ú§Þ§Ö§â)

§±§â§Ú§Þ§Ö§â. 
§£§Ó§à§Õ:  3 4 5
§£§í§Ó§à§Õ: 3+4+5=12
             3*4*5= 60
             (3+4+5)/3=4
			  
§£§Ó§à§Õ:   5 8 9
§£§í§Ó§à§Õ: 5+8+9=22
             5*8*9=360
             (5+8+9)/3=7.333333
*/
#include <stdio.h>
int main()
{
	int a,b,c,x;
	float y;
	scanf("%d %d %d",&a,&b,&c);
	x=(a+b+c)/3;
	y=(a+b+c)/3.0;
	printf("%d+%d+%d=%d\n",a,b,c,a+b+c);
	printf("%d*%d*%d=%d\n",a,b,c,a*b*c);
	if ((y-x)>0) {
		printf("(%d+%d+%d)/3=%f\n",a,b,c,y);
	} else {
		printf("(%d+%d+%d)/3=%d\n",a,b,c,x);
	}
	return 0;
 } 
